tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "cmake"
brew "dockutil"
brew "duti"
brew "exa"
brew "fd"
brew "ffmpeg"
# brew "gawk"
brew "gh"
brew "ghq"
brew "git"
brew "jq"
brew "mas"
brew "peco"
brew "pure"
brew "trash"
brew "tree"
brew "volta"
brew "wget"
cask "appcleaner"
# cask "bitwarden"
cask "clipy"
cask "deepl"
cask "discord"
cask "docker"
# font https://github.com/yuru7/PlemolJP
# source han code だとhomebrewで管理できないのでこれ使う。
cask "font-plemol-jp"
cask "font-plemol-jp-hs"
cask "font-plemol-jp-nf"
cask "gitify"
cask "google-chrome"
# cask "imhex"
cask "karabiner-elements"
# cask "krisp"
# cask "microsoft-openjdk"
# cask "notion"
cask "postman"
cask "qlmarkdown"
cask "raycast"
cask "rectangle"
cask "scroll-reverser"
cask "sourcetree"
cask "the-unarchiver"
cask "visual-studio-code"
# mas "Bitwarden", id: 1352778147
# mas "Keynote", id: 409183694
mas "Micro Sniff", id: 1504024265
mas "Microsoft To Do", id: 1274495053
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
vscode "anteprimorac.html-end-tag-labels"
vscode "christian-kohler.path-intellisense"
# vscode "davidhouchin.whitespace-plus"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
# vscode "formulahendry.auto-close-tag"
# vscode "formulahendry.auto-rename-tag"
# vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "jock.svg"
# vscode "heybourn.headwind"
# vscode "IBM.output-colorizer"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mosapride.zenkaku"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode.remote-repositories"
vscode "naumovs.color-highlight"
# vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
# vscode "ritwickdey.LiveServer"
# vscode "sastan.twind-intellisense"
# vscode "stylelint.vscode-stylelint"
vscode "steoates.autoimport"
vscode "VisualStudioExptTeam.vscodeintellicode"
# vscode "vscodevim.vim"
# vscode "wart.ariake-dark"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"